# Pandas

1)Pandas is used to analyze data.

2)Pandas is a Python library used for working with data sets.

3)It has functions for analyzing, cleaning, exploring, and manipulating data

In [1]:
import pandas as pd
import numpy as np

In [2]:
d1 = {
    "name":['shubham', 'rohit', 'sandesh', 'sharad', 'akshay'],
     "city":['pune', 'mumbai', 'goa', 'baramati', 'nagpur'],
     "marks":[30, 20, 80, 90 ,70]
}

In [3]:
d2 = pd.DataFrame(d1)

In [4]:
d2

      name      city  marks
0  shubham      pune     30
1    rohit    mumbai     20
2  sandesh       goa     80
3   sharad  baramati     90
4   akshay    nagpur     70

In [5]:

a = [1, 7, 2]

aser = pd.Series(a)

aser

0    1
1    7
2    2
dtype: int64

In [6]:
d2.to_csv('marks.csv') 
# to_csv('marks.csv', index= False)

In [7]:
d2.head(2)

      name    city  marks
0  shubham    pune     30
1    rohit  mumbai     20

In [8]:
d2.tail(3)

      name      city  marks
2  sandesh       goa     80
3   sharad  baramati     90
4   akshay    nagpur     70

In [9]:
d2.describe()

           marks
count   5.000000
mean   58.000000
std    31.144823
min    20.000000
25%    30.000000
50%    70.000000
75%    80.000000
max    90.000000

In [10]:
data = pd.read_csv('Data1.csv')

In [11]:
data

   index vehicle  speed       city
0      1    Hero     50       pune
1      2   shine    100  hyderabad
2      3  suzuki    200     mumbai
3      4    tata     60    kolkata
4      5     ola     40   benglore

In [12]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [13]:
data.columns

Index(['index', 'vehicle', 'speed', 'city'], dtype='object')

In [14]:
data.sort_index(axis=0, ascending= False)

   index vehicle  speed       city
4      5     ola     40   benglore
3      4    tata     60    kolkata
2      3  suzuki    200     mumbai
1      2   shine    100  hyderabad
0      1    Hero     50       pune

In [15]:
data.index = list("ABCDE")
data

   index vehicle  speed       city
A      1    Hero     50       pune
B      2   shine    100  hyderabad
C      3  suzuki    200     mumbai
D      4    tata     60    kolkata
E      5     ola     40   benglore

In [16]:
#creating view (Note- every change of dview also reflect in data )
dview = data

In [17]:
dview.loc['A','speed']= 70

data

   index vehicle  speed       city
A      1    Hero     70       pune
B      2   shine    100  hyderabad
C      3  suzuki    200     mumbai
D      4    tata     60    kolkata
E      5     ola     40   benglore

In [18]:
# Creating copy (dcopy changes will not be reflect into data)
dcopy = data.copy()

In [19]:
dcopy.loc['A','speed']= 50

In [20]:
data

   index vehicle  speed       city
A      1    Hero     70       pune
B      2   shine    100  hyderabad
C      3  suzuki    200     mumbai
D      4    tata     60    kolkata
E      5     ola     40   benglore

In [21]:
#Show selected data
data.loc[['C', 'D'],['vehicle', 'speed']]

  vehicle  speed
C  suzuki    200
D    tata     60

In [22]:
#Show selected data
data.loc[['C', 'D'],::]

   index vehicle  speed     city
C      3  suzuki    200   mumbai
D      4    tata     60  kolkata

In [23]:
#Show selected data
data.loc[::,['vehicle', 'speed']]

  vehicle  speed
A    Hero     70
B   shine    100
C  suzuki    200
D    tata     60
E     ola     40

In [24]:
#Show selected data with the help of iloc
data.iloc[0,3]

'pune'

In [25]:
#Show selected data with the help of iloc
data.iloc[[1,4],[1,3]]

  vehicle       city
B   shine  hyderabad
E     ola   benglore

In [26]:
data.drop(['E', 'D'])

   index vehicle  speed       city
A      1    Hero     70       pune
B      2   shine    100  hyderabad
C      3  suzuki    200     mumbai

In [27]:
data

   index vehicle  speed       city
A      1    Hero     70       pune
B      2   shine    100  hyderabad
C      3  suzuki    200     mumbai
D      4    tata     60    kolkata
E      5     ola     40   benglore

In [28]:
data.drop(['E', 'D'], inplace= True)

In [29]:
data

   index vehicle  speed       city
A      1    Hero     70       pune
B      2   shine    100  hyderabad
C      3  suzuki    200     mumbai

In [30]:
#to find null values
data['speed'].isnull()

A    False
B    False
C    False
Name: speed, dtype: bool

In [31]:
#dropna 
import numpy as np
import pandas as pd

df = pd.DataFrame({
    "name":['shubham', np.nan, 'sandesh', 'sharad', np.nan,'sharad'],
     "city":['pune', np.nan, 'goa', 'baramati', 'nagpur', 'goa'],
     "marks":[np.nan, np.nan, 80, 90 ,70, 90]
})

In [32]:
df

      name      city  marks
0  shubham      pune    NaN
1      NaN       NaN    NaN
2  sandesh       goa   80.0
3   sharad  baramati   90.0
4      NaN    nagpur   70.0
5   sharad       goa   90.0

In [33]:
df.dropna()

      name      city  marks
2  sandesh       goa   80.0
3   sharad  baramati   90.0
5   sharad       goa   90.0

In [34]:
df.dropna(how= 'all')

      name      city  marks
0  shubham      pune    NaN
2  sandesh       goa   80.0
3   sharad  baramati   90.0
4      NaN    nagpur   70.0
5   sharad       goa   90.0

In [35]:
#Remove duplicate values
df.drop_duplicates(subset = ['name'], keep = 'first')

      name      city  marks
0  shubham      pune    NaN
1      NaN       NaN    NaN
2  sandesh       goa   80.0
3   sharad  baramati   90.0

In [36]:
df.info

<bound method DataFrame.info of       name      city  marks
0  shubham      pune    NaN
1      NaN       NaN    NaN
2  sandesh       goa   80.0
3   sharad  baramati   90.0
4      NaN    nagpur   70.0
5   sharad       goa   90.0>

In [37]:
df['city'].value_counts(dropna=True)

goa         2
pune        1
baramati    1
nagpur      1
Name: city, dtype: int64

In [38]:
df.corr()

       marks
marks    1.0

In [39]:
df['marks'].std()

9.574271077563381

In [40]:
df['marks'].min()

70.0

In [41]:
df.max()

C:\Users\Shubham\AppData\Local\Temp/ipykernel_26324/1299571182.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.max()

marks    90.0
dtype: float64

In [42]:
df['marks'].max()

90.0

In [43]:
df['marks'].count()

4

In [44]:
df['marks'].median()

85.0

In [45]:
#Read excel file with sheet

data1 = pd.read_excel('data22.xlsx', sheet_name='Sheet1')

In [46]:
data1

   index vehicle  speed       city
0      1    Hero     50       pune
1      2   shine    100  hyderabad
2      3  suzuki    200     mumbai
3      4    tata     60    kolkata
4      5     ola     40   benglore

In [47]:
data2 = pd.read_excel('data22.xlsx', sheet_name='Sheet2')

In [48]:
data2

   index22 vehicle22  speed22      city22
0        1      Hero     5000       punee
1        2     shine      400  hyderabadd
2        3    suzuki     1000     mumbaii
3        4      tata      505    kolkataa
4        5     olaaa      200   bengloree